load_testing/results/auth_buy_info/auth_buy_info.txt
  ✓ Status is 200
  ✓ Response contains token
  ✗ Response time is less than 50ms
  ↳  99% — ✓ 238685 / ✗ 34
  ✓ Response body includes coins
  ✓ Response body includes inventory
  ✓ Response body includes coinHistory

  checks.........................: 99.99%  795696 out of 795730
  data_received..................: 52 MB   175 kB/s
  data_sent......................: 69 MB   230 kB/s
  dropped_iterations.............: 346     1.151673/s
  http_req_blocked...............: avg=2.57µs  min=584ns    med=1.45µs  max=6.49ms   p(90)=2.58µs  p(95)=3.62µs 
  http_req_connecting............: avg=231ns   min=0s       med=0s      max=949.08µs p(90)=0s      p(95)=0s     
✓ http_req_duration..............: avg=2.05ms  min=261.56µs med=1.91ms  max=157.02ms p(90)=3.37ms  p(95)=4.06ms 
    { expected_response:true }...: avg=2.05ms  min=261.56µs med=1.91ms  max=157.02ms p(90)=3.37ms  p(95)=4.06ms 
  http_req_failed................: 0.00%   0 out of 238719
  http_req_receiving.............: avg=25.11µs min=4.95µs   med=16.83µs max=9.16ms   p(90)=35.7µs  p(95)=53.37µs
  http_req_sending...............: avg=7.93µs  min=1.95µs   med=4.75µs  max=6.36ms   p(90)=10.91µs p(95)=14.91µs
  http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
  http_req_waiting...............: avg=2.01ms  min=247.85µs med=1.89ms  max=156.97ms p(90)=3.34ms  p(95)=4.01ms 
  http_reqs......................: 238719  794.584161/s
  iteration_duration.............: avg=1s      min=1s       med=1s      max=1.17s    p(90)=1s      p(95)=1.01s  
  iterations.....................: 79573   264.861387/s
✗ slow_responses.................: 100.00% 34 out of 34
  vus............................: 2       min=2                max=345
  vus_max........................: 356     min=10               max=356